package com.mentoring.level2.streamHW.student.util;
/*
Преобразовать этот список студентов в ассоциативный массив, где ключом является номер курса, а значением:

Средняя оценка студентов этого курса, количество оценок у которых больше 3-х

Список студентов данного курса, но только с полями Имя и Фамилия.
Список должен быть отсортированы по этим двум полям

Объект с двумя полями:
- Отсортированный список студентов с пункта 2
- Средняя оценка этих студентов

Подумать, как ассоциативный массив можно было представить в коде в виде отсортированного - TreeMap
 */

import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class StudentsUtil<T> {

    public Map result(List<T> list){

//        new HashMap<Integer, >()
//        list.stream()


        return Map.of();
    }


}
